app/controllers/comments_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "comments" ("user_id", "book_id", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 4], ["book_id", 3], ["comment", "test"], ["created_at", "2021-06-09 01:19:07.773047"], ["updated_at", "2021-06-09 01:19:07.773047"]]
---
  def create
    @book = Book.find(params[:book_id])
    comment = current_user.comments.new(comment_params)
    comment.book_id = @book.id
    comment.save

DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 6]]
SELECT  "comments".* FROM "comments" WHERE "comments"."book_id" = ? AND "comments"."id" = ? LIMIT ?  [["book_id", 1], ["id", 6], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    Comment.find_by(book_id: params[:book_id], id: params[:id]).destroy
    @book = Book.find(params[:book_id])